---
kind: type
id: T:Autodesk.Revit.DB.NavisworksParameters
source: html/27a9771e-59c6-f28e-414e-7f5c0f6b6b5c.htm
---
# Autodesk.Revit.DB.NavisworksParameters

An enumerated type listing possible "Parameter conversions" of Navisworks Exporter.

## Syntax (C#)
```csharp
public enum NavisworksParameters
```